<template>
  <div class="task-card">
    <section class="task-card__wrapper">
      <!--      Кнопка закрытия диалога задачи-->

      <!--      Блок ввода имени и удаления задачи-->
      <div class="task-card__block">
        <div class="task-card__row">
          <!--          Поле ввода имени задачи-->

          <!--          Кнопка удаления задачи-->
        </div>
        <!--        Ошибка валидации поля ввода имени -->
      </div>

      <!--      Блок статуса задачи-->
      <div class="task-card__status">
        <!--        Список статусов задачи-->
      </div>

      <!--      Блок даты выполнения задачи-->

      <!--      Блок ввода пользователя и даты срока выполнения-->
      <div class="task-card__block">
        <ul class="task-card__params">
          <!--          Блок выбора пользователя-->

          <!--          Блок выбора даты выполнения-->
        </ul>
      </div>

      <!--      Блок описания задачи-->

      <!--      Блок внешней ссылки-->
      <div class="task-card__block">
        <div class="task-card__links">
          <div class="task-card__links-item">
            <!--            Поле ввода ссылки-->

            <!--            Ошибка валидации поля ввода ссылки-->

            <!--            Описание ссылки-->
          </div>
        </div>
      </div>

      <!--      Блок подзадач-->
      <div class="task-card__block">
        <!--        Список подзадач-->
      </div>

      <!--      Блок тегов-->
      <div class="task-card__block">
        <!--        Компонент создания тегов-->
      </div>

      <!--      Блок сохранения и отмены изменений-->
      <div class="task-card__buttons">
        <!--        Кнопка отмены изменений-->

        <!--        Кнопка сохранения изменений-->
      </div>
    </section>
  </div>
</template>
